//定数 fruitsを定義して、５つの文字列を要素とする配列を連想配列で宣言を行います。
//  各要素の文字列は "橙", "赤", "黄", "黄緑", "緑"
//  各要素の文字列は　"オレンジ", "リンゴ", "バナナ", "パイナップル", "キュウイ"
  const fruits = {
    "橙":"オレンジ", 
    "赤":"リンゴ", 
    "黄":"バナナ", 
    "黄緑":"パイナップル", 
    "緑":"キュウイ"
  };

//キー"橙"を使って、連想配列　fruitsの値をコンソール画面に出力します。
  console.log(fruits["橙"]);

//キー"赤"を使って、連想配列　fruitsの値をコンソール画面に出力します。
  console.log(fruits["赤"]);
//キー"黄"を使って、連想配列　fruitsの値をコンソール画面に出力します。
  console.log(fruits["黄"]);
//キー"黄緑"を使って、連想配列　fruitsの値をコンソール画面に出力します。
  console.log(fruits["黄緑"]);

//キー"緑"を使って、連想配列　fruitsの値をコンソール画面に出力します。
  console.log(fruits["緑"]);

//キー"青"を使って、連想配列　fruitsの値をコンソール画面に出力します。
  console.log(fruits["青"]);
